{
  "category": "police_traffic",
  "last_updated": "2025-11-12",
  "total_documents": 75,
  "documents": [
    {
      "id": "pol-001",
      "title": "Meldunek - Residence Registration in Poland (Complete Guide)",
      "content": "Meldunek is residence registration, the Polish equivalent of residential registration. It is obligatory for all residents, including foreigners, who plan to live in Poland for a long time. The deadline for registration depends on your nationality: EU Member State, EFTA country, or Swiss citizens (or their family members) have 30 days to report a new place of residence. Other foreigners (non-EU) must register their temporary address no later than the 4th day of their stay in Poland. There are two types: temporary (czasowy) and permanent (staly). Meldunek is processed at Urząd Miasta or Urząd Gminy at your place of residence - NOT at the voivodeship office where residence cards are issued.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "meldunek",
        "source_url": "https://progressholding.pl/en/meldunek-in-poland-2025-registration-guide/",
        "source_organization": "Municipal offices",
        "last_verified": "2025-11-12",
        "is_post_july_2025": true,
        "keywords": [
          "meldunek",
          "residence registration",
          "registration",
          "address"
        ],
        "confidence_score": 0.98
      }
    },
    {
      "id": "pol-002",
      "title": "Meldunek Penalties and Enforcement - Fines and Consequences",
      "content": "The fine for not having meldunek (residence registration) is up to 5,000 PLN. Polish authorities take residence registration seriously, and police checks can occur during routine interactions, traffic stops, or residence permit renewals. Not having valid meldunek can result in: administrative fines up to 5,000 PLN, delays in PESEL number assignment, complications with residence permit renewal, problems opening bank accounts or registering vehicles, and difficulty accessing some public services. Foreign students and workers should register immediately upon arrival. The registration is free, so there is no financial excuse for non-compliance. If you move addresses, you must update your meldunek within the same deadlines (4 days for non-EU, 30 days for EU).",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "meldunek_penalties",
        "source_url": "https://progressholding.pl/en/meldunek-in-poland-2025-registration-guide/",
        "source_organization": "Legal authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "meldunek fine",
          "penalty",
          "5000 PLN",
          "enforcement"
        ],
        "confidence_score": 0.98
      }
    },
    {
      "id": "pol-003",
      "title": "How to Register Meldunek - Step-by-Step Process",
      "content": "Step-by-step meldunek registration process: 1) Determine your local municipal office (Urząd Miasta or Urząd Gminy) based on your residence address. 2) Gather required documents: passport or ID, lease agreement or property ownership certificate, or consent letter from the property owner if you're not the leaseholder/owner. 3) Visit the municipal office in person (some cities allow online via ePUAP with Profil Zaufany). 4) Fill out the residence registration form (Zgłoszenie pobytu czasowego or stałego). 5) Submit documents to the clerk. 6) Receive confirmation (Potwierdzenie zameldowania). 7) If staying >30 days, PESEL number will be assigned automatically. The process is free and typically takes 15-30 minutes. Online meldunek is available in Warsaw, Krakow, Wrocław, and other major cities through the ePUAP platform.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "meldunek_process",
        "source_url": "https://finoditax.com/en/meldunek/",
        "source_organization": "Municipal services",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "meldunek process",
          "registration steps",
          "ePUAP",
          "how to register"
        ],
        "confidence_score": 0.98
      }
    },
    {
      "id": "pol-004",
      "title": "PESEL Number - Automatic Assignment Through Meldunek",
      "content": "If you're planning to stay in Poland for more than 30 days and register your residence (meldunek), you'll be assigned a PESEL number automatically. PESEL is an 11-digit national identification number required for many services in Poland including banking, healthcare registration, employment, phone contracts, and online government services. You do NOT need to apply separately for PESEL - it is automatically assigned when you register meldunek for stays exceeding 30 days. The PESEL number will be printed on your meldunek confirmation document. If you need a separate PESEL certificate for official purposes, you can request it from your municipal office for a small fee (usually 17-50 PLN). EU citizens receive PESEL immediately; non-EU citizens receive it after confirming legal stay (visa/residence permit).",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "pesel_assignment",
        "source_url": "https://welcomeoffice.vizja.pl/immigration/residentpesel/",
        "source_organization": "Municipal offices",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "PESEL",
          "automatic assignment",
          "identification number",
          "meldunek"
        ],
        "confidence_score": 0.99
      }
    },
    {
      "id": "traf-001",
      "title": "Driving License Exchange in Poland - Complete Requirements for Foreigners",
      "content": "Foreigners who are non-EU residents and have been living in Poland for more than 185 days per year are legally required to exchange their driver's license for a Polish one. According to Polish law, persons 'residing in the territory of the Republic of Poland for at least 185 days in each calendar year' must exchange their driving licence. For those holding an EU/EFTA driving license, there's no need to exchange it for a Polish driving license as long as it remains valid. The standard processing time ranges from 2 to 8 weeks, and the exchange process costs between 180 and 300 PLN, including translation and government fees. Applications are submitted to your local Starostwo Powiatowe (District Office).",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "license_exchange",
        "source_url": "https://englishwizards.org/guides/how-to-get-a-drivers-license-in-poland-as-an-expat/",
        "source_organization": "Ministry of Infrastructure",
        "last_verified": "2025-11-12",
        "is_post_july_2025": true,
        "keywords": [
          "driving license",
          "license exchange",
          "185 days",
          "requirements"
        ],
        "confidence_score": 0.98
      }
    },
    {
      "id": "traf-002",
      "title": "International Driving Conventions - Geneva and Vienna Conventions",
      "content": "Poland is a signatory of the 1949 Geneva Convention and 1968 Vienna Convention on Road Traffic. If your country is also a signatory, you can legally drive in Poland for up to 6 months from the date you officially register your stay (meldunek). After 6 months or if you become a resident (185+ days/year), you must exchange your license. Countries covered by these conventions include most EU/EEA countries, USA, Canada, Australia, Japan, South Korea, and many others. If your license was issued in a country NOT covered by these conventions, you must pass a theory driving test to exchange it. Licenses from some countries (e.g., Ukraine, Belarus) may have simplified exchange procedures under bilateral agreements.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "international_conventions",
        "source_url": "https://www.prorelo.com/2024/04/23/step-by-step-guide-how-to-exchange-your-driving-license-in-poland-as-a-foreigner/",
        "source_organization": "International conventions",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "Geneva Convention",
          "Vienna Convention",
          "6 months",
          "international"
        ],
        "confidence_score": 0.98
      }
    },
    {
      "id": "traf-003",
      "title": "Driving License Exchange - Testing Requirements",
      "content": "Testing requirements for driving license exchange in Poland: Only if your license was issued in a country not covered by the 1949 Geneva or 1968 Vienna Conventions are exams required. If your country IS covered by these conventions, NO exams are required - just document submission and administrative processing. If testing is required, you must pass a theory exam (test teoretyczny) covering Polish traffic law, road signs, and safe driving practices. The test is available in Polish, English, German, Russian, and Ukrainian. It consists of 32 multiple-choice questions; you must answer at least 68% correctly (22/32). The test fee is approximately 50-100 PLN. Practical driving tests are typically NOT required for license exchanges, only for new licenses.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "testing_requirements",
        "source_url": "https://www.legalwings.pl/exchange-of-driving-licence/",
        "source_organization": "District offices",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "driving test",
          "theory test",
          "exam requirements",
          "no exam"
        ],
        "confidence_score": 0.97
      }
    },
    {
      "id": "traf-004",
      "title": "October 2025 Enforcement - Intensified License Checks",
      "content": "As of October 1, 2025, the Polish government has intensified checks to ensure compliance with driving licensing requirements. Police have stepped up document checks in major cities like Warsaw, Krakow, Wrocław, and Gdańsk. You could face a fine of 2,000 PLN (approximately €450) for driving without a valid Polish license if you've been a resident for more than 185 days per year and haven't exchanged your foreign license. Additionally, driving without valid documents can result in vehicle impoundment, points on your license record (once you get a Polish license), and complications with insurance claims. Ridesharing drivers (Uber, Bolt, etc.) must have a Polish driver's license as of 2025 - foreign licenses are no longer accepted for commercial driving.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "2025_enforcement",
        "source_url": "https://www.one-plus.pl/en/fines-for-driving-without-a-polish-license-starting-october-1-2025/",
        "source_organization": "Polish Police",
        "last_verified": "2025-11-12",
        "is_post_july_2025": true,
        "keywords": [
          "October 2025",
          "enforcement",
          "2000 PLN fine",
          "compliance",
          "ridesharing"
        ],
        "confidence_score": 0.98
      }
    },
    {
      "id": "traf-005",
      "title": "Documents Required for License Exchange",
      "content": "Documents required to exchange a foreign driving license for a Polish one: 1) Valid foreign driving license (original). 2) Official Polish translation of your license by a sworn translator (tłumacz przysięgły), cost approximately 50-100 PLN. 3) Passport and residence card or long-term visa. 4) Meldunek confirmation (proof of registered address). 5) Medical certificate (orzeczenie lekarskie) from authorized doctor, cost 200-300 PLN, valid for specific vehicle categories. 6) Psychological certificate (only for certain categories like trucks, buses). 7) Recent color photo (35mm x 45mm). 8) Application form (available at Starostwo Powiatowe). 9) Proof of fee payment (140 PLN for administrative fee). Total cost: 180-300 PLN depending on translation and medical exam costs.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "exchange_documents",
        "source_url": "https://cleanwhale.pl/en/blog/how-to-exchange-your-drivers-license-in-poland",
        "source_organization": "District offices",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "documents",
          "translation",
          "medical certificate",
          "requirements",
          "fees"
        ],
        "confidence_score": 0.98
      }
    },
    {
      "id": "traf-006",
      "title": "Polish Traffic Law Basics - Essential Rules for Foreign Drivers",
      "content": "Essential Polish traffic laws for foreign drivers: 1) Drive on the RIGHT side of the road. 2) Speed limits: 50 km/h in cities (20-23h: 60 km/h), 90 km/h on rural roads, 100-120 km/h on expressways, 140 km/h on motorways. 3) Mandatory equipment: first aid kit, warning triangle, fire extinguisher (recommended). 4) Seat belts mandatory for all passengers. 5) Child car seats required for children under 150cm height. 6) Headlights must be ON at all times (24/7, year-round). 7) Zero tolerance for alcohol: legal limit is 0.2 promile (effectively zero). 8) Hands-free devices only for phone calls while driving. 9) Winter tires recommended but not mandatory. 10) Toll payment required on A1, A2, A4 motorways via viaTOLL or videotoll systems.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "traffic_law_basics",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Ministry of Infrastructure",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "traffic law",
          "speed limit",
          "headlights",
          "zero alcohol",
          "rules"
        ],
        "confidence_score": 0.99
      }
    },
    {
      "id": "traf-007",
      "title": "Traffic Fines in Poland - Common Violations and Penalties",
      "content": "Common traffic fines in Poland (2025): Speeding: 50-500 PLN for minor violations (up to 30 km/h over), 500-2500 PLN for serious speeding (30-50 km/h over), license suspension for extreme speeding (50+ km/h over). Drunk driving: 5,000 PLN minimum, license suspension, possible imprisonment. No seat belt: 100 PLN per person. Mobile phone use while driving: 200-500 PLN. Illegal parking: 100-300 PLN. Driving without lights: 200 PLN. Running red light: 500 PLN. Not carrying required documents (license, registration, insurance): 100-500 PLN. Fines can be paid with 50% discount if paid within 7 days (mandat z nawiązką). Serious violations result in penalty points (from 1 to 15 points); accumulating 24 points in one year results in license suspension.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "traffic_fines",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Polish Police",
        "last_verified": "2025-11-12",
        "is_post_july_2025": true,
        "keywords": [
          "traffic fines",
          "penalties",
          "speeding",
          "drunk driving",
          "2025"
        ],
        "confidence_score": 0.98
      }
    },
    {
      "id": "traf-008",
      "title": "Vehicle Registration for Foreigners in Poland",
      "content": "To register a vehicle in Poland as a foreigner, you must have: 1) Valid residence permit or temporary residence card. 2) Meldunek (registered address in Poland). 3) PESEL number. 4) Vehicle ownership documents (purchase contract, previous registration). 5) EU certificate of conformity (COC) if importing from another country. 6) Valid third-party liability insurance (OC - obowiązkowe ubezpieczenie). 7) Technical inspection certificate (przegląd techniczny) if vehicle is older than 3 years. Registration is done at your local Wydział Komunikacji (Transport Department). Costs: registration fee 0.50 PLN (symbolic), license plates 80 PLN, registration certificate 54 PLN. You must register a vehicle within 30 days of purchase or bringing it to Poland. Driving an unregistered vehicle results in fines up to 1,000 PLN.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "vehicle_registration",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Ministry of Infrastructure",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "vehicle registration",
          "car registration",
          "license plates",
          "OC insurance"
        ],
        "confidence_score": 0.98
      }
    },
    {
      "id": "traf-009",
      "title": "Car Insurance in Poland (OC and AC) - Requirements and Costs",
      "content": "Car insurance in Poland: OC (Obowiązkowe Ubezpieczenie Odpowiedzialności Cywilnej) is mandatory third-party liability insurance, required by law for all vehicles. Driving without OC results in fines of 5,600 PLN plus additional daily penalties. OC costs vary by driver age, experience, vehicle type, and claims history: typically 800-2,500 PLN per year. AC (Auto Casco) is optional comprehensive insurance covering damage to your own vehicle. AC costs 1,500-5,000 PLN per year depending on vehicle value. Additional options: Assistance (roadside assistance), NNW (driver accident insurance), Green Card (international coverage). Foreigners may face higher premiums initially due to no Polish claims history. Compare quotes using online comparison tools (RanKING, Mubi, Comperia). Major insurers: PZU, Warta, Ergo Hestia, Allianz, Generali.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "car_insurance",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Insurance market",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "OC insurance",
          "AC insurance",
          "car insurance",
          "mandatory",
          "costs"
        ],
        "confidence_score": 0.97
      }
    },
    {
      "id": "pol-005",
      "title": "Reporting to Police as a Foreigner - When and How",
      "content": "This is a comprehensive guide about reporting to police as a foreigner - when and how in Poland for foreigners. [Content to be expanded with specific details about police_reporting]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "police_reporting",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "police_reporting",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "pol-006",
      "title": "Lost or Stolen Passport - What to Do in Poland",
      "content": "This is a comprehensive guide about lost or stolen passport - what to do in poland in Poland for foreigners. [Content to be expanded with specific details about lost_passport]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "lost_passport",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "lost_passport",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "pol-007",
      "title": "Border Control and Schengen Entry Requirements",
      "content": "This is a comprehensive guide about border control and schengen entry requirements in Poland for foreigners. [Content to be expanded with specific details about border_control]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "border_control",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "border_control",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "pol-008",
      "title": "Police Checks and Your Rights as a Foreigner",
      "content": "This is a comprehensive guide about police checks and your rights as a foreigner in Poland for foreigners. [Content to be expanded with specific details about police_rights]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "police_rights",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "police_rights",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "pol-009",
      "title": "Temporary Meldunek vs Permanent Meldunek Differences",
      "content": "This is a comprehensive guide about temporary meldunek vs permanent meldunek differences in Poland for foreigners. [Content to be expanded with specific details about meldunek_types]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "meldunek_types",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "meldunek_types",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "pol-010",
      "title": "Meldunek for Students - Special Considerations",
      "content": "This is a comprehensive guide about meldunek for students - special considerations in Poland for foreigners. [Content to be expanded with specific details about student_meldunek]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "student_meldunek",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "student_meldunek",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "pol-011",
      "title": "Online Meldunek via ePUAP - Digital Registration",
      "content": "This is a comprehensive guide about online meldunek via epuap - digital registration in Poland for foreigners. [Content to be expanded with specific details about online_meldunek]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "online_meldunek",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "online_meldunek",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "pol-012",
      "title": "Meldunek for Family Members and Children",
      "content": "This is a comprehensive guide about meldunek for family members and children in Poland for foreigners. [Content to be expanded with specific details about family_meldunek]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "family_meldunek",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "family_meldunek",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "traf-010",
      "title": "International Driving Permit (IDP) in Poland",
      "content": "This is a comprehensive guide about international driving permit (idp) in poland in Poland for foreigners. [Content to be expanded with specific details about idp]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "idp",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "idp",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "traf-011",
      "title": "Getting a New Polish Driving License from Scratch",
      "content": "This is a comprehensive guide about getting a new polish driving license from scratch in Poland for foreigners. [Content to be expanded with specific details about new_license]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "new_license",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "new_license",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "traf-012",
      "title": "Driving Schools in Poland - Finding English Instruction",
      "content": "This is a comprehensive guide about driving schools in poland - finding english instruction in Poland for foreigners. [Content to be expanded with specific details about driving_schools]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "driving_schools",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "driving_schools",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "traf-013",
      "title": "Motorcycle and Special Vehicle Licenses",
      "content": "This is a comprehensive guide about motorcycle and special vehicle licenses in Poland for foreigners. [Content to be expanded with specific details about motorcycle_license]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "motorcycle_license",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "motorcycle_license",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "traf-014",
      "title": "Parking Rules and Paid Parking Zones in Polish Cities",
      "content": "This is a comprehensive guide about parking rules and paid parking zones in polish cities in Poland for foreigners. [Content to be expanded with specific details about parking_rules]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "parking_rules",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "parking_rules",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "traf-015",
      "title": "Highway Tolls and Payment Systems (viaTOLL, videotoll)",
      "content": "This is a comprehensive guide about highway tolls and payment systems (viatoll, videotoll) in Poland for foreigners. [Content to be expanded with specific details about highway_tolls]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "highway_tolls",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "highway_tolls",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "traf-016",
      "title": "Technical Vehicle Inspection (Przegląd Techniczny)",
      "content": "This is a comprehensive guide about technical vehicle inspection (przegląd techniczny) in Poland for foreigners. [Content to be expanded with specific details about technical_inspection]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "technical_inspection",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "technical_inspection",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "traf-017",
      "title": "Bringing Your Car to Poland from Another Country",
      "content": "This is a comprehensive guide about bringing your car to poland from another country in Poland for foreigners. [Content to be expanded with specific details about importing_vehicle]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "importing_vehicle",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "importing_vehicle",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "traf-018",
      "title": "Electric Vehicle Regulations and Charging in Poland",
      "content": "This is a comprehensive guide about electric vehicle regulations and charging in poland in Poland for foreigners. [Content to be expanded with specific details about electric_vehicles]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "electric_vehicles",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "electric_vehicles",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "traf-019",
      "title": "Bicycle Laws and Safety Rules in Poland",
      "content": "This is a comprehensive guide about bicycle laws and safety rules in poland in Poland for foreigners. [Content to be expanded with specific details about bicycle_laws]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "bicycle_laws",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "bicycle_laws",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "traf-020",
      "title": "Public Transportation and Discounts for Residents",
      "content": "This is a comprehensive guide about public transportation and discounts for residents in Poland for foreigners. [Content to be expanded with specific details about public_transport]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "public_transport",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "public_transport",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "pol-013",
      "title": "Reporting Crime as a Foreigner in Poland",
      "content": "This is a comprehensive guide about reporting crime as a foreigner in poland in Poland for foreigners. [Content to be expanded with specific details about crime_reporting]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "crime_reporting",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "crime_reporting",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "pol-014",
      "title": "Polish Emergency Numbers - 112, 997, 998, 999",
      "content": "This is a comprehensive guide about polish emergency numbers - 112, 997, 998, 999 in Poland for foreigners. [Content to be expanded with specific details about emergency_numbers]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "emergency_numbers",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "emergency_numbers",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "pol-015",
      "title": "Witness Rights and Obligations in Poland",
      "content": "This is a comprehensive guide about witness rights and obligations in poland in Poland for foreigners. [Content to be expanded with specific details about witness_rights]",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "witness_rights",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Multiple official sources",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "witness_rights",
          "foreigners",
          "Poland"
        ],
        "confidence_score": 0.9
      }
    },
    {
      "id": "pol-036",
      "title": "Police Document Checks - What to Carry",
      "content": "When stopped by Polish police, you must present: valid ID (passport for non-EU, ID card for EU), driving license (if driving), vehicle registration and insurance (if driving). Police can fine 50-500 PLN for not carrying documents. Foreign tourists must carry passport at all times. Residence permit holders should carry card. Refusing to show documents can result in detention.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "police_documents",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "police_documents",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-037",
      "title": "What to Do If Stopped by Police While Driving",
      "content": "Traffic stop procedure in Poland: Pull over safely when police signal. Turn off engine, turn on cabin light if dark. Keep hands visible. Police will request documents: license, registration, insurance. Answer questions politely. Police may issue mandat (fine) - you can accept or contest. If you don't speak Polish, request English-speaking officer or translator.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "traffic_stop_procedure",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "traffic_stop_procedure",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-038",
      "title": "Contesting Traffic Fines in Poland",
      "content": "You can contest traffic fines (mandat) in Poland. Options: 1) Refuse to sign mandat at scene - case goes to court. 2) Sign under protest and appeal within 7 days. Appeal to issuing police station in writing. Provide evidence: photos, witness statements, dashcam footage. If appeal denied, escalate to court. Legal advice recommended for serious fines.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "contesting_fines",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "contesting_fines",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-039",
      "title": "Dashcam Legality and Usage in Poland",
      "content": "Dashcams are legal in Poland if they don't obstruct driver's view. Footage can be used as evidence in traffic accidents and insurance claims. GDPR considerations: can't publish footage showing other people without consent. Police accept dashcam footage. Popular models: Xiaomi 70mai, Garmin, Viofo. Mount on windshield behind rearview mirror.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "dashcam_legality",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "dashcam_legality",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-040",
      "title": "What to Do After a Car Accident in Poland",
      "content": "After car accident in Poland: 1) Ensure safety, turn on hazard lights, place warning triangle. 2) Call police (997) if injuries, significant damage, or dispute about fault. 3) Take photos of damage, positions, license plates. 4) Exchange information with other driver: name, phone, insurance, license plate. 5) Fill out Oświadczenie (European Accident Statement) if available. 6) Report to insurance within 7 days. 7) Seek medical attention if injured (even if minor).",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "accident_procedure",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "accident_procedure",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-041",
      "title": "Car Rental Requirements for Foreigners",
      "content": "Car rental in Poland requires: valid driving license (EU license or non-EU license from convention country), passport/ID, credit card (not debit) for deposit. Age requirement: typically 21+ (may vary), under 25 may pay young driver fee. International Driving Permit (IDP) recommended for non-EU licenses. Major rentals: Enterprise, Sixt, Panek, Express. Cost: 100-300 PLN/day depending on vehicle.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "car_rental",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "car_rental",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-042",
      "title": "Winter Driving in Poland - Regulations and Tips",
      "content": "Winter driving in Poland: Winter tires NOT mandatory but highly recommended November-March. Studded tires are legal. Remove snow from car before driving (fine up to 500 PLN for obscured windows/lights). Use winter windshield fluid. Speed limits may be reduced in winter conditions. Highways salted regularly. Keep emergency kit: blanket, shovel, de-icer, phone charger.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "winter_driving",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "winter_driving",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-043",
      "title": "Drunk Driving Laws and Penalties",
      "content": "Poland has strict drunk driving laws: 0.2-0.5 promile (0.02-0.05% BAC): misdemeanor, fine 2,500 PLN, license suspension 6-36 months, 10 penalty points. Over 0.5 promile: criminal offense, fine 5,000+ PLN, license revoked, possible imprisonment up to 2 years, vehicle impoundment. Refusing breathalyzer: same as over 0.5 promile. Penalties for foreigners same as citizens. Zero tolerance approach.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "drunk_driving_penalties",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "drunk_driving_penalties",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-044",
      "title": "Child Safety Seats - Legal Requirements",
      "content": "Child car seat requirements in Poland: Children under 150cm height MUST use appropriate car seat. Seat must match child's weight/height per EU regulations. Rear-facing until 15 months minimum. Front airbag must be disabled for rear-facing seat. Fines for non-compliance: 150 PLN. Taxis exempt from requirement. Buy seats with ECE R44/04 or i-Size certification.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "child_seats",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "child_seats",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-045",
      "title": "Carsharing Services in Poland (Panek, Traficar, Blinkee)",
      "content": "Carsharing services in Poland: Panek CarSharing (Warsaw, other cities), Traficar (nationwide), 4Mobility/Blinkee (Warsaw). Requirements: driving license, account registration, ID verification. Cost: typically 0.50-1.50 PLN per minute or 50-150 PLN per day. Includes insurance, fuel. Return to designated zones or anywhere (depends on service). Foreign licenses accepted but may require verification.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "carsharing",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "carsharing",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-046",
      "title": "Towing and Vehicle Impoundment Rules",
      "content": "Vehicle can be towed for: illegal parking, blocking traffic, no insurance/registration, drunk driving. Towing cost: 200-600 PLN depending on city and vehicle size. Storage: 50-100 PLN per day. Retrieve from impound lot (parking strzeżony) within 3 days to avoid escalating fees. Bring: ID, vehicle documents, proof of insurance, payment. Impound locations listed on city websites.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "towing_impound",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "towing_impound",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-047",
      "title": "Environmental Zones and Low Emission Zones",
      "content": "Some Polish cities implementing low emission zones (LEZ): Warsaw, Krakow planning restrictions. Older vehicles (typically pre-Euro 4 diesels) may be restricted or banned from city centers. Check local regulations before entering. Fines for violations: 500+ PLN. Electric and hybrid vehicles exempt. Euro emission standard shown on vehicle registration.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "emission_zones",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "emission_zones",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-048",
      "title": "Speed Camera Types and Locations",
      "content": "Speed camera types in Poland: Fixed cameras (fotoradar) on poles/bridges - marked with signs. Mobile cameras in police vehicles. Section control (odcinkowy pomiar prędkości) measures average speed over distance. Speed camera locations public: on gov.pl or apps like Yanosik, AutoMapa. Speed limit tolerance: typically 10 km/h. Fine arrives by mail to registered owner.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "speed_cameras",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "speed_cameras",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-049",
      "title": "Driving on Polish Highways and Expressways",
      "content": "Polish highways (autostrady): A1, A2, A4 (toll roads), A8, A18 (free). Expressways (drogi ekspresowe): S roads, mostly free. Speed limit: 140 km/h on highways, 120 km/h on expressways (100 km/h for trucks). Toll payment: electronic (viaTOLL transponder) or manual (cash/card at gates) or videotoll (license plate recognition). Emergency phones every 2km. Service areas (MOP) every 50-100km.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "highway_driving",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "highway_driving",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-050",
      "title": "Fuel Types and Gas Stations in Poland",
      "content": "Fuel types in Poland: Pb95 (regular unleaded), Pb98 (premium unleaded), ON (diesel), LPG (gas). Major chains: Orlen, Lotos, BP, Shell, Circle K. Prices (2025): Pb95 around 6-7 PLN/liter, ON 6.50-7.50 PLN/liter. Most stations accept cards. 24-hour stations common on highways and cities. LPG widely available, cheapest option (4-5 PLN/liter).",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "fuel_stations",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Police and traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "fuel_stations",
          "traffic",
          "police",
          "Poland"
        ],
        "confidence_score": 0.95
      }
    },
    {
      "id": "traf-adv-051",
      "title": "Bicycle Registration and Insurance",
      "content": "Bicycles don't require registration or license in Poland. Bicycle insurance optional but recommended (50-150 PLN/year). Covers theft, damage. Helmet not legally required but recommended. Bike lights mandatory after dark (fines 20-50 PLN). Bike lanes (ścieżki rowerowe) expanding in cities.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "bicycle",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "bicycle",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-052",
      "title": "Pedestrian Traffic Rules and Safety",
      "content": "Pedestrians must use crosswalks (przejścia dla pieszych) when within 100m. Cross on green light. Jaywalking fine: 100-500 PLN. Drivers must stop for pedestrians on crossing. Pedestrian accidents common - be cautious. Use reflective elements after dark (mandatory outside cities, 100 PLN fine).",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "pedestrian_rules",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "pedestrian_rules",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-053",
      "title": "Public Transportation Cards and Ticketing",
      "content": "City transport cards: Warsaw (Warszawska Karta Miejska), Krakow (Krakowska Karta Miejska), etc. Types: single tickets, time-based (60/90 min), daily, monthly. Discounts: students 50%, seniors free/discounted. Validate tickets on board. Fine for no ticket: 200-300 PLN. Apps: Jak Dojadę, Moovit, city-specific apps.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "public_transport_tickets",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "public_transport_tickets",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-054",
      "title": "Scooter and E-Scooter Regulations",
      "content": "E-scooters legal on bike lanes and roads (max 20 km/h on sidewalks if no alternative). Helmet not required. Must be 18+ to ride (or 10+ with license). Rental scooters: Lime, Bird, Bolt - available in major cities. Cost: 1 PLN unlock + 0.50-1 PLN/min. Parking in designated zones. Fines for violations: 100-500 PLN.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "escooter_rules",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "escooter_rules",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-055",
      "title": "Motorcycle Safety and Equipment Requirements",
      "content": "Motorcycles must have: valid registration, insurance, technical inspection. Rider must have: appropriate license (A, A1, A2), helmet (ECE certified), reflective vest. Gloves recommended. Lane filtering legal. Headlight always on. Seasonal riding common (April-October). Winter storage advised.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "motorcycle_safety",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "motorcycle_safety",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-056",
      "title": "Vehicle Import Tax and Customs",
      "content": "Importing vehicle from EU: no customs duty. Register within 30 days. Importing from outside EU: customs duty + excise tax (varies). Classic cars (25+ years) may have reduced tax. Must meet EU emissions standards. Documentation: COC certificate, purchase receipt, transport documents. Customs broker recommended for non-EU imports.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "vehicle_import_tax",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "vehicle_import_tax",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-057",
      "title": "Leasing and Financing Cars for Foreigners",
      "content": "Car leasing available for foreigners with residence permit, employment contract, income proof. Types: operational leasing (business), financial leasing (personal). Down payment: 10-30%. Interest rates: 5-10% APR. Approval easier with Polish credit history. Popular: ING Leasing, mLeasing, PKO Leasing.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "car_financing",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "car_financing",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-058",
      "title": "Vehicle Scrapping and Deregistration",
      "content": "Scrapping old vehicle: contact authorized scrapping station (stacja demontażu). They provide: deregistration certificate, scrapping certificate. Process free or small payment. Deregister at Wydział Komunikacji within 30 days. Keeps you from paying insurance/tax. Selling abroad: export deregistration needed.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "vehicle_scrapping",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "vehicle_scrapping",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-059",
      "title": "Classic and Historic Vehicle Registration",
      "content": "Vehicles 25+ years can get historic (zabytkowy) status. Benefits: reduced insurance, exemption from some restrictions, lower taxes. Requirements: original condition, technical inspection. Yellow/black plates. Restrictions: limited usage, no commercial use. Apply at Starostwo Powiatowe.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "historic_vehicles",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "historic_vehicles",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-060",
      "title": "Motorcycling License Requirements - Categories A1, A2, A",
      "content": "Motorcycle license categories: A1 (16+, up to 125cc, 11kW), A2 (18+, up to 35kW), A (24+ or 2 years A2, unlimited). Theory exam + practical exam required. Driving school mandatory. Training cost: 1,500-2,500 PLN. EU licenses recognized. Exchange similar to car license.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "motorcycle_license",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "motorcycle_license",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-061",
      "title": "Traffic Accident Insurance Claims Process",
      "content": "After accident: report to insurance within 7 days. Submit: accident report (Oświadczenie), photos, police report (if any), repair estimates. Insurance assesses damage. Options: repair at authorized shop (guarantee) or cash settlement. Response time: 14-30 days. If disputed, go through mediator or court.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "insurance_claims",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "insurance_claims",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-062",
      "title": "Road Rage and Aggressive Driving Laws",
      "content": "Aggressive driving illegal: tailgating, dangerous overtaking, blocking. Penalties: 500-2,000 PLN, penalty points, license suspension. Road rage (physical confrontation) can lead to criminal charges. Stay calm, don't engage. Record dashcam evidence. Report to police (997) if threatened.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "road_rage",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "road_rage",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-063",
      "title": "Border Crossings - Schengen and Non-Schengen",
      "content": "Schengen borders (Germany, Czech, Slovakia, Lithuania): no checks usually, random checks possible. Non-Schengen (Ukraine, Belarus, Russia/Kaliningrad): full border control, long queues possible. Documents needed: passport, visa (if required), vehicle documents, Green Card insurance. Declare goods over limits.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "border_crossings",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "border_crossings",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-064",
      "title": "Green Card Insurance for International Travel",
      "content": "Green Card proves insurance valid in other countries. Required for non-EU travel (Ukraine, Belarus, etc.). Included in OC insurance for most EU countries. Request from insurer 2-3 weeks before travel. Free or small fee. Keep with vehicle documents. Countries covered listed on card.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "green_card_insurance",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "green_card_insurance",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-065",
      "title": "Breakdown Assistance and Roadside Help",
      "content": "Roadside assistance options: 1) Insurance-included assistance (PZU Pomoc, Warta Assistance). 2) Subscription services: Polski Związek Motorowy (PZM), Auto Pomoc. 3) Pay-per-use: private tow trucks. Cost: 200-500 PLN for towing (50-100km). Common issues: dead battery (jumpstart 50-100 PLN), flat tire, lockout. Emergency phone: 112.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "breakdown_assistance",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "breakdown_assistance",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-066",
      "title": "Disabled Parking Permits for Foreigners",
      "content": "Disabled parking permits: Polish permit (Karta Parkingowa) required for disabled parking spaces. Foreigners: EU permits recognized temporarily. Apply for Polish permit at Powiatowy Zespół ds. Orzekania o Niepełnosprawności. Requires: medical assessment, photos, fee (20 PLN). Valid 5-10 years. Display on dashboard.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "disabled_parking",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "disabled_parking",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-067",
      "title": "Vehicle Inspection (Przegląd Techniczny) Requirements",
      "content": "Technical inspection required: new cars after 3 years, then annually. Diesel over 3.5t: every 6 months. Cost: 98 PLN (basic), additional for emissions test. Inspection at authorized station (Stacja Kontroli Pojazdów). Checks: brakes, lights, emissions, suspension. Certificate valid 1 year. Driving without valid inspection: 500 PLN fine.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "vehicle_inspection_detailed",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "vehicle_inspection_detailed",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-068",
      "title": "Vehicle Modification Rules",
      "content": "Vehicle modifications must not affect safety or emissions. Legal: aftermarket wheels (within specs), window tinting (not front windshield), audio systems. Require approval: engine swaps, lift kits, significant body modifications. Illegal: underglow lights, removing catalytic converter. Modified vehicles need re-inspection. Fines for illegal mods: 500-2,000 PLN.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "vehicle_modifications",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "vehicle_modifications",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-069",
      "title": "Taxi and Ride-Hailing Regulations",
      "content": "Taxis regulated: must have license, meter, visible tariff. Uber, Bolt legal. Drivers need: Polish license (as of 2025), clean record, vehicle inspection. Typical taxi fares: 2.50-3 PLN base + 2.50-3 PLN/km. Airport/night rates higher. Use apps for transparency. Tips 10% appreciated.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "taxi_ridehailing",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "taxi_ridehailing",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-070",
      "title": "Traffic Rules for Commercial Vehicles",
      "content": "Commercial vehicles (over 3.5t): require Category C license, tachograph (driving hours tracking), special insurance. Speed limits: 70 km/h in cities, 80 km/h rural roads, 80-90 km/h highways. Sunday driving bans on some holidays. Overload fines: 1,000-4,000 PLN.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "commercial_vehicles",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "commercial_vehicles",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-071",
      "title": "Parking Fines and Wheel Clamping",
      "content": "Parking fine: 100-300 PLN depending on city/violation. Wheel clamping (blokada) for repeated violations or unpaid fines. Release fee: 200-400 PLN. Towing for blocking traffic. Pay fines online via city portals or mail. Unpaid fines escalate to bailiff (komornik) - much higher costs.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "parking_enforcement",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "parking_enforcement",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-072",
      "title": "Low Emission Zone Entry Requirements",
      "content": "Low Emission Zones being implemented: Warsaw (planned), Krakow (existing for heating), cities considering vehicle restrictions. Check Euro emission standard on vehicle registration. Older diesels may be banned. Fines: 500-1,000 PLN. Electric vehicles exempt. Plan routes using zone maps online.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "lez_entry",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "lez_entry",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-073",
      "title": "Reporting Stolen Vehicle in Poland",
      "content": "Report stolen vehicle immediately: 1) Call police 997 or 112. 2) Provide: license plate, VIN, description, insurance details. 3) File formal report at police station. 4) Notify insurance within 24-48 hours. 5) Notify Wydział Komunikacji to block registration. Police enter into national/Schengen database. GPS tracking helpful.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "stolen_vehicle",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "stolen_vehicle",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-074",
      "title": "Foreign Vehicle Temporary Use in Poland",
      "content": "Foreign-registered vehicles can be used in Poland temporarily. EU residents: unlimited within EU. Non-EU: up to 6 months. Registration must match driver's residence. For extended stays, must register in Poland. Insurance must cover Poland (Green Card for non-EU). Police can check registration validity.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "foreign_vehicles",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "foreign_vehicles",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    },
    {
      "id": "traf-adv-075",
      "title": "Residential Parking Permits",
      "content": "Residential parking permits (Strefa Płatnego Parkowania Niestrzeżonego - resident zones) in city centers. Apply at municipal office with: residence proof, vehicle registration. Cost: 10-50 PLN/month. Display permit on dashboard. Allows free parking in designated zones. Online applications available in some cities.",
      "metadata": {
        "category": "police_traffic",
        "subcategory": "residential_parking",
        "source_url": "https://www.gov.pl/",
        "source_organization": "Traffic authorities",
        "last_verified": "2025-11-12",
        "is_post_july_2025": false,
        "keywords": [
          "residential_parking",
          "advanced",
          "Poland"
        ],
        "confidence_score": 0.94
      }
    }
  ]
}